module.exports = {
  TOP_N_PAIRS: 50,
  PAIR_SUFFIX: 'USDT',
  SYMBOL_ANALYSIS_DELAY_MS: 500, // 0.5 сек между монетами (на 50 монет ≈ 25 сек)
  DEBUG_LOG_LEVEL: 'none', // 'none' | 'basic' | 'verbose'
  VOLATILITY_UPDATE_INTERVAL_HOURS: 6, // обновление каждые 6 часов после тестов поставить цифру 6

  DOJI_BODY_RATIO: 0.3, // 🔧 Условие для Doji: тело составляет менее 30% от полного диапазона свечи

                                          // === RSI Settings ===
  //**************************************************************************************************************************
  RSI_PERIOD: 14,
  //**************************************************************************************************************************
                                         
                                          // === strategyRSI_Volume_Fade ===**************************************************
  //**************************************************************************************************************************
  RSI_VOLUME_FADE: {
  RSI_HIGH_THRESHOLD: 70,
  RSI_LOW_THRESHOLD: 30,
  VOLUME_DROP_PERCENT: 10,     // можно менять на 5 или 15 по тестам
  TIMEFRAMES: ['5m', '15m']
  },
  //**************************************************************************************************************************
                                          // === MACD Settings ===
  //**************************************************************************************************************************
MACD_SETTINGS: {
  FAST_PERIOD: 12,     // короткая EMA
  SLOW_PERIOD: 26,     // длинная EMA
  SIGNAL_PERIOD: 9     // EMA сигнальной линии
},
  MACD_MIN_SIGNAL: 0.0001, // фильтрации слабых (флатовых) сигналов по гистограмме MACD
  //**************************************************************************************************************************
  
                                          // === EMA Settings ===
  //**************************************************************************************************************************
  EMA_SETTINGS: {
    PERIOD: 21,     // Количество свечей для расчёта EMA
    DEPTH: 7        // Глубина сравнения для угла наклона EMA (разница между началом и концом участка)
  },
  EMA_REQUIRED_CANDLES: 22, // минимальное количество свечей для расчёта стратегий EMA
  EMA_SHORT_PERIOD: 12, // короткий период EMA (обычно 9 или 12)
  EMA_LONG_PERIOD: 26, // длинный период EMA (обычно 21, 26 или 50)
  EMA_ANGLE_THRESHOLD: 0.05, //🔧 Порог угла наклона EMA (в радианах), выше которого считаем тренд направленным. 
                             //    Пример: 0.05 ~ 2.86°, что является умеренным наклоном
  // ***************************************************************************************************************************
                              
                                        // === Volume Settings ===
  /********************************************************************************************************************/
  AVERAGE_VOLUME_PERIOD: 20,     // Период для расчета среднего объема (по умолчанию 20 свечей)
  VOLUME_SPIKE_FACTOR: 1.5,      // Коэффициент превышения объема для определения "VOLUME_SPIKE"
  /********************************************************************************************************************/

                                        // === Breakout Proximity Settings ===
  // ******************************************************************************************************************
    BREAKOUT_PROXIMITY: {
      LOOKBACK: 20,         // Кол-во свечей для поиска ближайших High/Low
      THRESHOLD: 10         // Допустимое расстояние (%) до High/Low для сигнала "близко к уровню"
    },
  // ******************************************************************************************************************
  
                                        // === MeanReversion ===
  // ******************************************************************************************************************
  MEAN_REVERSION: {
  MA_PERIOD: 20, // Кол-во свечей для расчета средней цены
},
  // ******************************************************************************************************************

                                        // === ADX Settings ===
  // ******************************************************************************************************************
  ATR: {
  PERIOD: 14, // Период для расчёта ATR (обычно 14)
},
  // ******************************************************************************************************************           
    
                                        // === ADX Settings ===
  // ******************************************************************************************************************
  ADX_PERIOD: 14,  // Количество свечей для расчета ADX и DI
  // ******************************************************************************************************************

                                        // === FIBO Settings ===
  // ******************************************************************************************************************
  FIBO_SETTINGS: {
  DEPTH: 30,  // Кол-во последних свечей для анализа уровней
  LEVELS: [0.236, 0.382, 0.5, 0.618, 0.786]  // Наиболее часто используемые уровни Фибоначчи
},
  // ******************************************************************************************************************

  CACHE_LIMITS: {
  '5m': 120,
  '15m': 100,
  '1h': 72
}
  
};
